src/InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
					<Comment>(Общ) Ставка НДС 18%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18_118</Name>
					<Comment>(Общ) Расчетная ставка НДС 18% / 118%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
					<Comment>(Общ) Ставка НДС 10%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10_110</Name>
					<Comment>(Общ) Расчетная ставка НДС 10% / 110%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>(Общ) Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>(Общ) Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20_120</Name>
					<Comment>(Общ) Расчетная ставка НДС 20% / 120%</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>(Общ) Код производителя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изготовитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Изготовители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>(Общ) Ставка НДС по умолчанию для оформления документов</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бонус</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЛиквидности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЛиквидности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентПошлины</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТовараВНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаХраненияОстатков</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Набор</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаПроисхождения</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеИзображение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищеДополнительнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительноеОписаниеНоменклатуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительноеОписаниеНоменклатурыВФорматеHTML</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Акцизный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаЛогистическая</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТМЦ_ГруппыЛогистические</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаТоварная</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТМЦ_ГруппыТоварные</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерГТД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Литры</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ЕдиницыИзмерения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ЕдиницыИзмерения</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕдиницаПоКлассификатору</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/МодульРегламентныхЗаданийСервер/Ext/Module.bsl
//Для Загрузки номенклатуры из СПБ

Процедура СоздатьНоменклатуру(Таблица) Экспорт
	Для Каждого СтрокаТЧ Из Таблица Цикл 
		UUID = СтрокаТЧ.УИД;
		
		НоменклатураСсылка = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(UUID));
		Если ОбменДаннымиКлиентСервер.ЭтоБитаяСсылка(НоменклатураСсылка) Тогда 
			Отказ = Ложь;
			//Получили реквизиты номенклатуры с WS Сайта//
			ДокументDOM  = ДанныеНоменклатурыПоUUID(UUID, Отказ);
			Если НЕ Отказ Тогда
				//Сайт выдал читаемый результат//
				Разыменователь = Новый РазыменовательПространствИменDOM(ДокументDOM);
				
				НоменклатураНайдена = (ЗначениеЭлементаDOM(ДокументDOM, "/response/success", Разыменователь, 0) = "1");
				Если НоменклатураНайдена Тогда
					
					Наименование = ЗначениеЭлементаDOM(ДокументDOM, "/response/data/name", Разыменователь, "");
					БрендНаименование = ЗначениеЭлементаDOM(ДокументDOM, "/response/data/brand/name", Разыменователь, "");
					БрендUUID = ЗначениеЭлементаDOM(ДокументDOM, "/response/data/brand/uuid", Разыменователь, "");
					Артикул = ЗначениеЭлементаDOM(ДокументDOM, "/response/data/number", Разыменователь, "");
					Бренд = БрендПоUUID(БрендUUID, Наименование);
					
					//Попытка
						//Создаем новый элемент с нужными реквизитами//
						ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
						ЕдиницаИзмерения.Владелец = НоменклатураСсылка;
						ЕдиницаИзмерения.ЕдиницаПоКлассификатору = Константы.ОсновнаяЕдиницаПоКлассификатору.Получить();
						ЕдиницаИзмерения.Коэффициент = 1;
						ЕдиницаИзмерения.Наименование = ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Наименование;
						ЕдиницаИзмерения.ОбменДанными.Загрузка = Истина;
						ЕдиницаИзмерения.УстановитьНовыйКод();
						//ЕдиницаИзмерения.Записать();
						ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЕдиницаИзмерения);
						
						НовыйЭлемент = Справочники.Номенклатура.СоздатьЭлемент();
						НовыйЭлемент.УстановитьСсылкуНового(НоменклатураСсылка);
						// + 20181012 Пушкин XX-1114
						НовыйЭлемент.НаименованиеПолное = Наименование;
						// - 20181012 Пушкин XX-1114
						НовыйЭлемент.Наименование = Наименование;
						НовыйЭлемент.Изготовитель = Бренд;
						НовыйЭлемент.Артикул = Артикул;
						НовыйЭлемент.ЕдиницаХраненияОстатков = ЕдиницаИзмерения.Ссылка;
						НовыйЭлемент.СтавкаНДС = Перечисления.СтавкиНДС.НДС18;
						НовыйЭлемент.ДатаСоздания = ТекущаяДата();
						НовыйЭлемент.ОбменДанными.Загрузка = Истина;
						НовыйЭлемент.УстановитьНовыйКод();
						//НовыйЭлемент.Записать();
						ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовыйЭлемент);
						Менеджер = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
						Менеджер.Объект = НовыйЭлемент.Ссылка;
						Менеджер.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.Номенклатура_ЗагруженаИзСПБ;
						Менеджер.Значение = Истина;
						Менеджер.Записать();
					//Исключение
					//	
					//	Сообщить(ОписаниеОшибки());
					//	//СтруктураОтчета.Отказ = Истина;
					//	//ТекстОшибки = "Не записать номенклатуру: UUID = <" + UUID + ">" + ОписаниеОшибки();
					//	//ДополнитьОшибку(СтруктураОтчета.ТекстОшибки, ТекстОшибки);
					//КонецПопытки;
				Иначе
					Сообщить("Номенклатура не найдена по уиду " + UUID);
				КонецЕсли;
			Иначе
				Сообщить("Сайт выдал нечитаемое сообщение по уиду" + UUID);
			КонецЕсли;
		КонецЕсли;	
		//СтрокаТЧ.Номенклатура = НоменклатураСсылка;
	КонецЦикла;
КонецПроцедуры

Функция ДанныеНоменклатурыПоUUID(UUID, Отказ)
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
	
	ПараметрыЗапроса = "uuid=" + UUID;
	
	HTTPСоединение = Новый HTTPСоединение(АдресWEBСервиса());
	HTTPЗапрос = Новый HTTPЗапрос("/uuid/part_by_uuid", Заголовки); 
	HTTPЗапрос.УстановитьТелоИзСтроки(ПараметрыЗапроса, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	
	Если Ответ.КодСостояния = 200 Тогда
		Текст = Ответ.ПолучитьТелоКакСтроку();
			
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(Текст);

		ПостроительDOM = Новый ПостроительDOM;
		ДокументDOM  = ПостроительDOM.Прочитать(ЧтениеXML);
	Иначе
		Отказ = Истина;
		ДокументDOM = Неопределено;
	КонецЕсли;
	
	Возврат ДокументDOM;
	
КонецФункции

Функция БрендПоUUID(UUID, Наименование)
	
	БрендСсылка = Справочники.Изготовители.ПолучитьСсылку(Новый УникальныйИдентификатор(UUID));
	Если НЕ ЗначениеЗаполнено(БрендСсылка.ВерсияДанных) Тогда
		БС = Справочники.Номенклатура.НайтиПоНаименованию(Наименование);
		Если Не ЗначениеЗаполнено(БС) Тогда 
			НовыйЭлемент = Справочники.Изготовители.СоздатьЭлемент();
			НовыйЭлемент.УстановитьСсылкуНового(БрендСсылка);
			НовыйЭлемент.Наименование = Наименование;
			НовыйЭлемент.Записать();
			БрендСсылка = НовыйЭлемент.Ссылка;
		Иначе
			БрендСсылка = БС;
		КонецЕсли;
	КонецЕсли;
	
	Возврат БрендСсылка;
	
КонецФункции

Функция АдресWEBСервиса()
	
	Настройка = Справочники.НастройкиРеквизитовДляОбменов.API_Сайт;
	
	//Если ОбщегоНазначения.ЭтоРабочаяИнформационнаяБаза() Тогда
		Адрес = Настройка.СтрокаДляРабочейБазы;
	//Иначе
	//	Адрес = Настройка.СтрокаДляТестовойБазы;
	//КонецЕсли;
	
	Возврат Адрес;
	
КонецФункции

Функция ЗначениеЭлементаDOM(ДокументDOM, Путь, Разыменователь, ЗначениеПоУмолчанию)
	
	РезультатXPath = ДокументDOM.ВычислитьВыражениеXPath (Путь, ДокументDOM, Разыменователь);
	ПолученныйЭлемент = РезультатXPath.ПолучитьСледующий();
	
	Возврат ?(ПолученныйЭлемент = Неопределено, ЗначениеПоУмолчанию, ПолученныйЭлемент.ТекстовоеСодержимое);
	
КонецФункции

//Конец Загрузки из СПБ
